
Функция ИдетОбмен() Экспорт
	ТекстОшибки = "";
	Возврат ИдентификаторФоновогоЗадания <> Неопределено
		И НЕ ОбменМобильныеАвтономныйСервер.ОбменДаннымиЗакончен(ИдентификаторФоновогоЗадания, ТекстОшибки);
КонецФункции

// Процедура выполняет синхронизацию данных
// - запрашивает у пользователя пароль доступа к основной ИБ
// - запускает фоновый процесс синхронизации
// - если не удалось запустить фоновое задание, получает текст ошибки и сообщает пользователю
Процедура НачатьОбмен() Экспорт
	
#Если МобильныйКлиент Тогда
	ТекстОшибки = "";
	Если НЕ ИдетОбмен() Тогда
		Если ОсновнойСерверДоступен() = Истина Тогда
			ИдентификаторФоновогоЗадания = ОбменМобильныеАвтономныйСервер.ВыполнитьОбменДаннымиВФоне();
			Оповестить("НачалсяОбмен");
			ПодключитьОбработчикОжидания("НаблюдениеЗаСинхронизацией", 2);
		Иначе
		    Сообщение = Новый СообщениеПользователю();
		    Сообщение.Текст = НСтр("ru = 'Обмен невозможен. Недоступен основной сервер.'", "ru");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
#КонецЕсли
    
КонецПроцедуры
